xc-project/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "4JMliNkYDRi8rK2H8Q4Q0w"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= Users.find_by(session_token: session[:session_token])