xc-project/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bob"], ["LIMIT", 1]]
---
    def create

        usr = params[:user][:username]
        pwd = params[:user][:password]

        # we should check these for emptiness in FE before sending request

        if usr.length == 0 || pwd.length == 0