xc-project/app/controllers/users_controller.rb

    def create
        @user = Users.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "session_token", "password_digest", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bob Fisher"], ["session_token", "7VboFXAfzjyA_hjAmUBuEA"], ["password_digest", "$2a$12$IO3EkQa.IKJsCFOfJX2YUeFHTECQGomVkn.RfW3YA5d82bzK70LAy"], ["username", "bob"]]

    def show
        @user = Users.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def update
        @user = Users.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]