xc-project/app/controllers/users_controller.rb

    def index
        render json: Users.all
---
SELECT "users".* FROM "users"