xc-project/app/models/users.rb

    def self.find_by_credentials(name, password)
        @user = Users.find_by(name: name)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Bob"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        # update DB with updated session token
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "0Cj1LlGCtN835u85DD0nDg"], ["id", 5]]