xc-project/app/models/users.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bob"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        @user = Users.find_by(username: username)